#include <iostream>
#include <cmath>

using namespace std; //TODO Так делать не нужно, это плохой тон

/*TODO 
Функция main используется только для запуска основных функций программы.
Никакие алгоритмы в ней не пишутся, следовательно надо создать отдельную функцию, 
которая будет принимать числа A и B и возвращать простые числа между ними.

PS:Про функции попробуй узнать сам, если не получится, можешь задать вопросы
*/

int main()
{
  int a = 13;
  int b = 43;
  if ((a < b ) && (b < 250000)){
    for(int i {a}; i <= b; i++)
    {
      int c = 0;
      for(int j {2}; int(j <= sqrt(i)); j++)
      {
        if (i % j == 0)
        {
          c = c + 1;
          break;
        }
      }
      if (c == 0)
      {
        std::cout << i << std::endl; //TODO Не понятно тогда зачем using namespace(копипаст:))
      }
    }
  }
}
